# -*- coding: utf-8 -*-
from natasha import Segmenter, Doc

class Extractor():
    def run(self,document):
        segmenter = Segmenter()
        doc = Doc(document)
        doc.segment(segmenter)
        tokens = []
        for i in doc.tokens:
            print(i)
            # tokens.append(i[1])
        
        return tokens


if __name__=='__main__':
    extractor = Extractor()
    text = "Любовь Степушова 02.07.2015 10:59 (Обновлено: 03.10.2022 19:40) Любовь Александровна Степушова (родилась 6 апреля 1961 года в г. Москва) — обозреватель Правды.Ру Образование  Выпускница кафедры экономической географии Географического факультета МГУ имени М.В. Ломоносова, страновед, специалист по Латинской Америке и Африке, 1984 год. Опыт работы С 1986 года работала военным переводчиком. В Правде.Ру работает с 2007 года — редактором и автором португальской версии. С 2012 года международный обозреватель Правды.Ру. Достижения Свободно владеет португальским языком. E-mail: lubov.stepushova@pravda.ru ПРОФИЛИ В СОЦ. СЕТЯХ: * *Meta Platforms признана экстремистской организацией, её деятельность в России запрещена, а также принадлежащие ей социальные сети Facebook и Instagram так же запрещены в России."
    keywords = extractor.run(text)
    print(keywords)
    